#include <iostream>
#include "Alcohol.h"
#include <Windows.h>
using namespace std;

int main() {
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    // Створення об'єктів класу Alcohol
    Alcohol a1; // Створення за допомогою конструктора за замовчуванням
    Alcohol a2(5.5, Liquid("Water", 1.0)); // Створення за допомогою конструктора ініціалізації
    Alcohol a3 = a2; // Створення копії об'єкту a2

    // Виведення даних на екран
    cout << "Об'єкт a1 створений використовуючи базовий конструктор:" << endl;
    cout << a1 << endl;
    cout << "Об'єкт a2 створений використовуючи конструктор з параметрами:" << endl;
    cout << a2 << endl;
    cout << "Об'єкт a3 створений як копія a2:" << endl;
    cout << a3 << endl;

    // Інкремент та декремент об'єктів
    ++a2; // Префіксний інкремент
    --a3; // Префіксний декремент
    a1++; // Постфіксний інкремент
    a3--; // Постфіксний декремент

    // Виведення даних на екран після змін
    cout << "Після інкременту a2 (префіксний):" << endl;
    cout << a2 << endl;
    cout << "Після декременту a3 (префіксний):" << endl;
    cout << a3 << endl;
    cout << "Після інкременту a1 (постфіксний):" << endl;
    cout << a1 << endl;
    cout << "Після декременту a3 (постфіксний):" << endl;
    cout << a3 << endl;

    // Демонстрація різних способів створення масивів об'єктів
    cout << "Створення массиву об'єктів Alcohol:" << endl;
    Alcohol array[3]; // Створення масиву об'єктів за допомогою конструктора за замовчуванням
    cout << array[1];
    // Виведення розміру класу в режимі #pragma pack(1) і без нього
    cout << "розмір класу Alcohol без pragma pack(1): " << sizeof(Alcohol) << endl;
#pragma pack(1)
    cout << "розмір класу Alcohol з pragma pack(1): " << sizeof(Alcohol) << endl;
#pragma pack()
    return 0;
}